In [2]:
def my_sq(x):
    return x**2

In [3]:
def my_exp(x,n):
    return x**n

In [4]:
my_sq(3)

9

In [5]:
my_exp(3,3)

27

In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame({
    'a':[10,20,30],
    'b':[20,30,40]
})

In [8]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [10]:
df['a'].apply(my_sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [11]:
df['a'].apply(my_exp,n=3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [12]:
def print_me(x):
    print(x)

In [14]:
df.apply(print_me,axis=0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [15]:
import seaborn as sns

In [17]:
titanic = sns.load_dataset('titanic')

In [18]:
titanic.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [19]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [20]:
import numpy as np

In [24]:
def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [25]:
titanic.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64